Version2/TestTool-NOP.13.12.SR1/TestTool.Setup/Requests/RecordingControl/SetRecordingJobConfiguration/SetRecordingJobConfiguration (General).xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:trc="http://www.onvif.org/ver10/recording/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <trc:SetRecordingJobConfiguration>
      <trc:JobToken>tokenRecordingJob1</trc:JobToken>
      <trc:JobConfiguration>
        <trc:RecordingToken>tokenRecording2</trc:RecordingToken>
        <trc:Mode>Idle</trc:Mode>
        <trc:Priority>1</trc:Priority>
        <trc:Source>
          <trc:SourceToken Type="http://www.onvif.org/ver10/schema/Profile">
            <trc:Token>tokenRecording2</trc:Token>
          </trc:SourceToken>
          <trc:AutoCreateReceiver>false</trc:AutoCreateReceiver>
          <trc:Tracks>
            <trc:SourceTag>Current Tag</trc:SourceTag>
            <trc:Destination>TockenTrack1</trc:Destination>
          </trc:Tracks>
        </trc:Source>
      </trc:JobConfiguration>
    </trc:SetRecordingJobConfiguration>
  </soap:Body>
</soap:Envelope>